src/cfe/Documents/ДБЗакреплениеКонтрагентовВГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДБЗакреплениеКонтрагентовВГруппы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДБГруппыКонтрагентовДляОплатЖКХАВА</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Население</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеПотребители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/InformationRegisters/ДБГруппыКонтрагентовДляОплатЖКХАВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДБГруппыКонтрагентовДляОплатЖКХАВА</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппыОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДБГруппыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Documents/ДБЗакреплениеКонтрагентовВГруппы/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораБюджет", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНаселение(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораНаселение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПрочиеПотребители(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеПодбораПрочиеПотребители", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДБФорма",,ЭтаФорма, ,,,Оповещение,);
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораБюджет(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.Бюджет.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораНаселение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.Население.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеПодбораПрочиеПотребители(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Обход Из РезультатЗакрытия Цикл
		
		Выборка = Справочники.Контрагенты.Выбрать(Обход,,);
		
		Пока Выборка.Следующий() Цикл	
			Строка = Объект.ПрочиеПотребители.Добавить();
			Строка.Контрагент = Выборка.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиДокумента(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РезультатОтвета", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Записать документ?",РежимДиалогаВопрос.ДаНет, 60);
		Возврат;
	КонецЕсли;
	
	ПросмотретьДвиженияДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПросмотретьДвиженияДокумента();
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПросмотретьДвиженияДокумента()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Регистратор", Объект.Ссылка));
	
	ОткрытьФорму("РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.Форма.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
